In [1]:
# Install required libraries
!pip install pandas sqlalchemy

Requirement already satisfied: pandas in c:\users\stanl\anaconda3\lib\site-packages (2.2.3)
Requirement already satisfied: sqlalchemy in c:\users\stanl\anaconda3\lib\site-packages (2.0.39)
Requirement already satisfied: numpy>=1.26.0 in c:\users\stanl\anaconda3\lib\site-packages (from pandas) (2.1.3)
Requirement already satisfied: python-dateutil>=2.8.2 in c:\users\stanl\anaconda3\lib\site-packages (from pandas) (2.9.0.post0)
Requirement already satisfied: pytz>=2020.1 in c:\users\stanl\anaconda3\lib\site-packages (from pandas) (2024.1)
Requirement already satisfied: tzdata>=2022.7 in c:\users\stanl\anaconda3\lib\site-packages (from pandas) (2025.2)
Requirement already satisfied: greenlet!=0.4.17 in c:\users\stanl\anaconda3\lib\site-packages (from sqlalchemy) (3.1.1)
Requirement already satisfied: typing-extensions>=4.6.0 in c:\users\stanl\anaconda3\lib\site-packages (from sqlalchemy) (4.12.2)
Requirement already satisfied: six>=1.5 in c:\users\stanl\anaconda3\lib\site-packages (from python-dateutil>=2.8.2->pandas) (1.17.0)

In [2]:
#Import libraries and connect to the SQLite database
import pandas as pd
from sqlalchemy import create_engine
#Create a connection to the Chinook SQLite database
engine = create_engine('sqlite:///Chinook_Sqlite.sqlite')

In [3]:
#  Write SQL query to join 5 tables
# Customer -> Invoice -> InvoiceLine -> Track -> Album
# We select customer's last and first names, track names, and album titles
# Sort results by customer last name, then first name
query = """
SELECT 
    c.LastName AS CustomerLastName,
    c.FirstName AS CustomerFirstName,
    t.Name AS TrackName,
    a.Title AS AlbumTitle
FROM Customer c
JOIN Invoice i ON c.CustomerId = i.CustomerId
JOIN InvoiceLine il ON i.InvoiceId = il.InvoiceId
JOIN Track t ON il.TrackId = t.TrackId
JOIN Album a ON t.AlbumId = a.AlbumId
ORDER BY c.LastName, c.FirstName;
"""

In [4]:
# Execute the query and load results into a pandas DataFrame
df = pd.read_sql(query, engine)

# Export to CSV
df.to_csv('customer_tracks.csv', index=False)

# Display the first 5 rows of the DataFrame
df.head()

,CustomerLastName,CustomerFirstName,TrackName,AlbumTitle
0,Almeida,Roberto,Right Next Door to Hell,Use Your Illusion I
1,Almeida,Roberto,In The Evening,In Through The Out Door
2,Almeida,Roberto,Fool In The Rain,In Through The Out Door
3,Almeida,Roberto,Saudade Dos Aviões Da Panair (Conversando No Bar),Minas
4,Almeida,Roberto,Caso Você Queira Saber,Minas

In [ ]:
## Conclusion

In this project, we successfully connected to the Chinook database, joined five tables 
to retrieve customers' purchased tracks along with album titles, and displayed the 
results in a pandas DataFrame. The data was sorted by customer last and first names. 
Finally, we exported the DataFrame to a CSV file, which can be used for further analysis 
or reporting. This project demonstrates how SQL queries and pandas can be combined 
to analyze relational database data efficiently.